ciaa/firmware_v1/externals/drivers/msp430/inc/msp430i2xxgeneric.h
#define FRKEY               (0x9600)  /* Flash key returned by read */
#define FWKEY               (0xA500)  /* Flash key for write */
#define FXKEY               (0x3300)  /* for use with XOR instruction */

#define ERASE               (0x0002)  /* Enable bit for Flash segment erase */
#define MERAS               (0x0004)  /* Enable bit for Flash mass erase */
#define WRT                 (0x0040)  /* Enable bit for Flash write */
#define BLKWRT              (0x0080)  /* Enable bit for Flash segment write */
#define SEGWRT              (0x0080)  /* old definition */ /* Enable bit for Flash segment write */

#define FN0                 (0x0001)  /* Divide Flash clock by 1 to 64 using FN0 to FN5 according to: */
#define FN1                 (0x0002)  /*  32*FN5 + 16*FN4 + 8*FN3 + 4*FN2 + 2*FN1 + FN0 + 1 */
#ifndef FN2
#define FN2                 (0x0004)
#endif
#ifndef FN3
#define FN3                 (0x0008)
#endif
#ifndef FN4
#define FN4                 (0x0010)
#endif
#define FN5                 (0x0020)
#define FSSEL0              (0x0040)  /* Flash clock select 0 */        /* to distinguish from USART SSELx */
#define FSSEL1              (0x0080)  /* Flash clock select 1 */

#define FSSEL_0             (0x0000)  /* Flash clock select: 0 - ACLK */
#define FSSEL_1             (0x0040)  /* Flash clock select: 1 - MCLK */
#define FSSEL_2             (0x0080)  /* Flash clock select: 2 - SMCLK */
#define FSSEL_3             (0x00C0)  /* Flash clock select: 3 - SMCLK */

#define BUSY                (0x0001)  /* Flash busy: 1 */
#define KEYV                (0x0002)  /* Flash Key violation flag */
#define ACCVIFG             (0x0004)  /* Flash Access violation flag */
#define WAIT                (0x0008)  /* Wait flag for segment write */
#define LOCK                (0x0010)  /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX                (0x0020)  /* Flash Emergency Exit */
#define LOCKSEG             (0x0040)  /* Flash Info Lock bit: read = 1 - Segment is locked (read only) */

#endif
/************************************************************
* HARDWARE MULTIPLIER
************************************************************/
#ifdef  __MSP430_HAS_MPY__            /* Definition to show that Module is available */

#define OFS_MPY               (0x0000)  /* Multiply Unsigned/Operand 1 */
#define OFS_MPYS              (0x0002)  /* Multiply Signed/Operand 1 */
#define OFS_MAC               (0x0004)  /* Multiply Unsigned and Accumulate/Operand 1 */
#define OFS_MACS              (0x0006)  /* Multiply Signed and Accumulate/Operand 1 */
#define OFS_OP2               (0x0008)  /* Operand 2 */
#define OFS_RESLO             (0x000A)  /* Result Low Word */
#define OFS_RESHI             (0x000C)  /* Result High Word */
#define OFS_SUMEXT            (0x000E)  /* Sum Extend */

#endif
/************************************************************
* PMM - Power Management System
************************************************************/
#ifdef  __MSP430_HAS_PMM__            /* Definition to show that Module is available */


#define OFS_LPM45CTL          (0x0000)  /* PMM Power Mode 4.5 Control Register */
#define OFS_VMONCTL           (0x0001)  /* PMM Voltage Monitor Control Register */
#define OFS_REFCAL0           (0x0002)  /* PMM Reference Calibration Register 0 */
#define OFS_REFCAL1           (0x0003)  /* PMM Reference Calibration Register 1 */

#define VCMONCTL            VMONCTL   /* Legacy Define */

/* LPM45CTL Power Mode 5 Control Bits */
#define LOCKLPM45           (0x0001)  /* Lock I/O pin configuration upon entry/exit to/from LPM4.5 */
#define LPM45IFG            (0x0002)  /* LPM4.5 interrupt flag */
#define PMMREGOFF           (0x0010)  /* PMM Turn Regulator off */

/* Voltage Monitor Control Bits */
#define VMONLVL0            (0x0001)  /* Voltage monitor level selection Bit 0 */
#define VMONLVL1            (0x0002)  /* Voltage monitor level selection Bit 1 */
#define VMONLVL2            (0x0004)  /* Voltage monitor level selection Bit 2 */
#define VMONIE              (0x0010)  /* Voltage monitor interrupt enable */
#define VMONIFG             (0x0020)  /* Voltage monitor interrupt flag */

#define VMONLVL_0           (0x0000)  /* Voltage monitor level selection: 0 */
#define VMONLVL_1           (0x0001)  /* Voltage monitor level selection: 1 */
#define VMONLVL_2           (0x0002)  /* Voltage monitor level selection: 2 */
#define VMONLVL_3           (0x0003)  /* Voltage monitor level selection: 3 */
#define VMONLVL_4           (0x0004)  /* Voltage monitor level selection: 4 */
#define VMONLVL_5           (0x0005)  /* Voltage monitor level selection: 5 */
#define VMONLVL_6           (0x0006)  /* Voltage monitor level selection: 6 */
#define VMONLVL_7           (0x0007)  /* Voltage monitor level selection: 7 */

/* Reference Calibration 0 Bits */
#define BGFINE0             (0x0001)  /* Bandgap voltage fine calibration Bit 0 */
#define BGFINE1             (0x0002)  /* Bandgap voltage fine calibration Bit 1 */
#define BGFINE2             (0x0004)  /* Bandgap voltage fine calibration Bit 2 */
#define BGFINE3             (0x0008)  /* Bandgap voltage fine calibration Bit 3 */
#define BGCOARSE0           (0x0010)  /* Bandgap voltage coarse calibration Bit 0 */
#define BGCOARSE1           (0x0020)  /* Bandgap voltage coarse calibration Bit 1 */

/* Reference Calibration 1 Bits */
#define BGCURVE0            (0x0001)  /* Curvature compensation Bit 0 */
#define BGCURVE1            (0x0002)  /* Curvature compensation Bit 1 */
#define BGCURVE2            (0x0004)  /* Curvature compensation Bit 2 */
#define BGCURVE3            (0x0008)  /* Curvature compensation Bit 3 */
#define BIASCURRENT0        (0x0010)  /* Bandgap bias current calibration Bit 0 */
#define BIASCURRENT1        (0x0020)  /* Bandgap bias current calibration Bit 1 */
#define BIASCURRENT2        (0x0040)  /* Bandgap bias current calibration Bit 2 */
#define BIASCURRENT3        (0x0080)  /* Bandgap bias current calibration Bit 3 */

#endif
/************************************************************
* DIGITAL I/O Port1/2
************************************************************/
#ifdef  __MSP430_HAS_PORT1__        /* Definition to show that Module is available */
#ifdef  __MSP430_HAS_PORT2__        /* Definition to show that Module is available */
#ifdef  __MSP430_HAS_PORTA__        /* Definition to show that Module is available */

